/****************************************************************************/
/* XMAMEのオプションなのでサウンドなしコンパイル時に無視したいオプション    */
/****************************************************************************/


T_IGNORE_OPT ignore_opt[] = 
{
  { "sound",     1, },  { "snd",       1, },
  { "nosound",   1, },  { "nosnd",     1, },

  { "volume",    2, },  { "v",         2, },
  { "fmvol",     2, },  { "fv",        2, },
  { "psgvol",    2, },  { "pv",        2, },
  { "beepvol",   2, },  { "bv",        2, },

  { "rhythmvol", 2, },  { "rv",        2, },
  { "adpcmvol",  2, },  { "av",        2, },

  { "close",     1, },
  { "noclose",   1, },

  { "nofmgen",   1, },
  { "fmgen",     1, },

  { 0, 0 },
};



